#### Terraform Format and Style `success`
#### Terraform Initialization `success`
#### Terraform Validation `success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan `success`

<details><summary>Show Plan</summary>

```

module.test.data.google_project.project: Reading...
module.test.data.google_project.project: Read complete after 0s [id=projects/cq-provider-gcp]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.test.google_kms_crypto_key.key-us-east1 will be created
  + resource "google_kms_crypto_key" "key-us-east1" {
      + destroy_scheduled_duration = (known after apply)
      + id                         = (known after apply)
      + import_only                = (known after apply)
      + key_ring                   = (known after apply)
      + name                       = "cq-secrets-cryptokey"
      + purpose                    = "ENCRYPT_DECRYPT"

      + version_template {
          + algorithm        = (known after apply)
          + protection_level = (known after apply)
        }
    }

  # module.test.google_kms_crypto_key_iam_member.crypto_key will be created
  + resource "google_kms_crypto_key_iam_member" "crypto_key" {
      + crypto_key_id = (known after apply)
      + etag          = (known after apply)
      + id            = (known after apply)
      + member        = "serviceAccount:service-163549298763@gcp-sa-secretmanager.iam.gserviceaccount.com"
      + role          = "roles/cloudkms.cryptoKeyEncrypterDecrypter"
    }

  # module.test.google_kms_key_ring.keyring-us-east1 will be created
  + resource "google_kms_key_ring" "keyring-us-east1" {
      + id       = (known after apply)
      + location = "us-east1"
      + name     = "cq-secrets-keyring"
      + project  = (known after apply)
    }

  # module.test.google_pubsub_topic.pubsub-basic will be created
  + resource "google_pubsub_topic" "pubsub-basic" {
      + id      = (known after apply)
      + name    = "cq-secrets-topic"
      + project = (known after apply)

      + message_storage_policy {
          + allowed_persistence_regions = (known after apply)
        }

      + schema_settings {
          + encoding = (known after apply)
          + schema   = (known after apply)
        }
    }

  # module.test.google_pubsub_topic_iam_member.binding will be created
  + resource "google_pubsub_topic_iam_member" "binding" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:service-163549298763@gcp-sa-secretmanager.iam.gserviceaccount.com"
      + project = "cq-provider-gcp"
      + role    = "roles/pubsub.publisher"
      + topic   = (known after apply)
    }

  # module.test.google_secret_manager_secret.secret-basic will be created
  + resource "google_secret_manager_secret" "secret-basic" {
      + create_time = (known after apply)
      + expire_time = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + project     = (known after apply)
      + secret_id   = "cq-secret"

      + replication {
          + user_managed {
              + replicas {
                  + location = "us-east1"

                  + customer_managed_encryption {
                      + kms_key_name = (known after apply)
                    }
                }
            }
        }

      + rotation {
          + next_rotation_time = "2050-01-01T00:00:01Z"
          + rotation_period    = "3153600000s"
        }

      + topics {
          + name = (known after apply)
        }
    }

Plan: 6 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.binary

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.binary"

```

</details>

*Pusher: @shimonp21, Action: `pull_request_target`, Working Directory: ``, Workflow: `terraform_plan`*